{
  "text": {
    "how": 87,
    "can": 29,
    "i": 88,
    "budget": 25,
    "better": 23,
    "what": 194,
    "are": 13,
    "some": 169,
    "budgeting": 26,
    "tips": 180,
    "give": 80,
    "me": 117,
    "for": 71,
    "making": 115,
    "a": 0,
    "monthly": 119,
    "save": 159,
    "more": 120,
    "money": 118,
    "good": 82,
    "saving": 160,
    "strategies": 174,
    "ideas": 89,
    "improving": 92,
    "my": 124,
    "savings": 161,
    "track": 182,
    "expenses": 58,
    "s": 155,
    "the": 179,
    "best": 22,
    "way": 193,
    "to": 181,
    "spending": 170,
    "on": 128,
    "logging": 112,
    "daily": 42,
    "do": 47,
    "manage": 116,
    "credit": 38,
    "card": 31,
    "debt": 44,
    "usage": 189,
    "avoid": 16,
    "late": 107,
    "fees": 63,
    "loans": 111,
    "work": 198,
    "is": 105,
    "loan": 110,
    "interest": 99,
    "calculate": 28,
    "emi": 55,
    "an": 8,
    "investment": 104,
    "start": 172,
    "investing": 103,
    "explain": 59,
    "basics": 20,
    "of": 126,
    "reduce": 149,
    "taxes": 178,
    "tax": 177,
    "planning": 139,
    "filing": 66,
    "should": 168,
    "salary": 158,
    "allocating": 7,
    "income": 95,
    "increase": 96,
    "from": 74,
    "paycheck": 135,
    "help": 85,
    "figure": 64,
    "out": 131,
    "repayment": 151,
    "control": 36,
    "overspending": 133,
    "stop": 173,
    "impulse": 93,
    "purchases": 145,
    "choose": 35,
    "health": 84,
    "insurance": 98,
    "plan": 138,
    "look": 113,
    "in": 94,
    "premiums": 141,
    "retirement": 152,
    "when": 195,
    "accounts": 3,
    "use": 190,
    "education": 51,
    "apply": 11,
    "student": 175,
    "rates": 148,
    "vehicle": 192,
    "rate": 147,
    "car": 30,
    "have": 83,
    "auto": 15,
    "set": 167,
    "up": 187,
    "need": 125,
    "emergency": 54,
    "fund": 75,
    "much": 122,
    "emergencies": 53,
    "building": 27,
    "score": 162,
    "improve": 91,
    "why": 197,
    "important": 90,
    "mutual": 123,
    "funds": 76,
    "invest": 102,
    "fixed": 70,
    "deposits": 46,
    "fd": 61,
    "fds": 62,
    "offer": 127,
    "does": 49,
    "inflation": 97,
    "affect": 5,
    "purchasing": 146,
    "power": 140,
    "protect": 143,
    "finance": 67,
    "home": 86,
    "purchase": 144,
    "mortgage": 121,
    "options": 130,
    "exist": 57,
    "balance": 17,
    "transfer": 184,
    "transfers": 185,
    "beneficial": 21,
    "trap": 186,
    "falling": 60,
    "into": 101,
    "getting": 78,
    "ensure": 56,
    "financial": 69,
    "security": 164,
    "stable": 171,
    "future": 77,
    "against": 6,
    "risks": 154,
    "finances": 68,
    "as": 14,
    "freelancer": 73,
    "gig": 79,
    "economy": 50,
    "apps": 12,
    "safe": 156,
    "which": 196,
    "app": 10,
    "tracks": 183,
    "link": 108,
    "bank": 18,
    "account": 2,
    "it": 106,
    "remove": 150,
    "linked": 109,
    "pay": 134,
    "utility": 191,
    "bills": 24,
    "online": 129,
    "electricity": 52,
    "cryptocurrency": 41,
    "crypto": 39,
    "cryptocurrencies": 40,
    "carry": 32,
    "goals": 81,
    "define": 45,
    "achieving": 4,
    "targets": 176,
    "send": 165,
    "abroad": 1,
    "service": 166,
    "international": 100,
    "overseas": 132,
    "charges": 34,
    "banks": 19,
    "charge": 33,
    "maintenance": 114,
    "file": 65,
    "returns": 153,
    "documents": 48,
    "deadline": 43,
    "upi": 188,
    "safely": 157,
    "payments": 137,
    "secure": 163,
    "prevent": 142,
    "payment": 136,
    "fraud": 72,
    "annual": 9,
    "yearly": 199,
    "costs": 37
  },
  "intent": {
    "budgeting_tips": 3,
    "saving_strategies": 28,
    "expense_tracking": 10,
    "credit_card_management": 4,
    "loans_and_interest": 21,
    "investment_basics": 20,
    "tax_planning": 31,
    "salary_and_income_management": 27,
    "emi_and_debt_calculation": 9,
    "smart_spending_habits": 30,
    "health_insurance_guidance": 16,
    "retirement_planning": 26,
    "education_loans": 7,
    "vehicle_loans": 34,
    "monthly_budget_planning": 22,
    "emergency_fund_creation": 8,
    "understanding_credit_score": 32,
    "mutual_funds": 23,
    "fixed_deposits": 14,
    "inflation_and_purchasing_power": 18,
    "home_buying_finances": 17,
    "balance_transfers": 0,
    "debt_traps": 6,
    "financial_security_tips": 13,
    "freelance_and_gig_economy_finance": 15,
    "finance_apps_usage": 12,
    "bank_account_linking": 1,
    "paying_utility_bills": 24,
    "cryptocurrency_basics": 5,
    "setting_financial_goals": 29,
    "international_money_transfers": 19,
    "bank_charges": 2,
    "filing_tax_returns": 11,
    "upi_and_online_payment_safety": 33,
    "planning_for_annual_expenses": 25
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_balance_transfers": 12,
    "utter_bank_account_linking": 13,
    "utter_bank_charges": 14,
    "utter_budgeting_tips": 15,
    "utter_credit_card_management": 16,
    "utter_cryptocurrency_basics": 17,
    "utter_debt_traps": 18,
    "utter_education_loans": 19,
    "utter_emergency_fund_creation": 20,
    "utter_emi_and_debt_calculation": 21,
    "utter_expense_tracking": 22,
    "utter_filing_tax_returns": 23,
    "utter_finance_apps_usage": 24,
    "utter_financial_security_tips": 25,
    "utter_fixed_deposits": 26,
    "utter_freelance_and_gig_economy_finance": 27,
    "utter_health_insurance_guidance": 28,
    "utter_home_buying_finances": 29,
    "utter_inflation_and_purchasing_power": 30,
    "utter_international_money_transfers": 31,
    "utter_investment_basics": 32,
    "utter_loans_and_interest": 33,
    "utter_monthly_budget_planning": 34,
    "utter_mutual_funds": 35,
    "utter_paying_utility_bills": 36,
    "utter_planning_for_annual_expenses": 37,
    "utter_retirement_planning": 38,
    "utter_salary_and_income_management": 39,
    "utter_saving_strategies": 40,
    "utter_setting_financial_goals": 41,
    "utter_smart_spending_habits": 42,
    "utter_tax_planning": 43,
    "utter_understanding_credit_score": 44,
    "utter_upi_and_online_payment_safety": 45,
    "utter_vehicle_loans": 46
  },
  "action_text": null,
  "intent_response_key": null
}