{
  "text": {
    "how": 50,
    "can": 16,
    "i": 51,
    "budgeting": 13,
    "tips": 88,
    "what": 97,
    "are": 6,
    "some": 83,
    "for": 38,
    "you": 99,
    "help": 48,
    "me": 61,
    "with": 98,
    "give": 43,
    "advice": 2,
    "on": 66,
    "do": 24,
    "effectively": 27,
    "best": 10,
    "practices": 72,
    "need": 65,
    "suggestions": 86,
    "example": 30,
    "__number__": 0,
    "saving": 78,
    "strategies": 85,
    "expense": 31,
    "tracking": 89,
    "credit": 20,
    "card": 17,
    "management": 60,
    "loans": 59,
    "and": 3,
    "interest": 55,
    "investment": 57,
    "basics": 9,
    "tax": 87,
    "planning": 70,
    "salary": 77,
    "income": 52,
    "emi": 29,
    "debt": 22,
    "calculation": 15,
    "smart": 82,
    "spending": 84,
    "habits": 46,
    "health": 47,
    "insurance": 54,
    "guidance": 45,
    "retirement": 74,
    "education": 26,
    "vehicle": 96,
    "monthly": 63,
    "budget": 12,
    "emergency": 28,
    "fund": 40,
    "creation": 19,
    "understanding": 92,
    "score": 79,
    "mutual": 64,
    "funds": 41,
    "fixed": 37,
    "deposits": 23,
    "inflation": 53,
    "purchasing": 73,
    "power": 71,
    "home": 49,
    "buying": 14,
    "finances": 35,
    "balance": 7,
    "transfers": 90,
    "traps": 91,
    "financial": 36,
    "security": 80,
    "freelance": 39,
    "gig": 42,
    "economy": 25,
    "finance": 34,
    "apps": 5,
    "usage": 94,
    "bank": 8,
    "account": 1,
    "linking": 58,
    "paying": 68,
    "utility": 95,
    "bills": 11,
    "cryptocurrency": 21,
    "setting": 81,
    "goals": 44,
    "international": 56,
    "money": 62,
    "charges": 18,
    "filing": 33,
    "returns": 75,
    "upi": 93,
    "online": 67,
    "payment": 69,
    "safety": 76,
    "annual": 4,
    "expenses": 32
  },
  "intent": {
    "budgeting_tips": 3,
    "saving_strategies": 28,
    "expense_tracking": 10,
    "credit_card_management": 4,
    "loans_and_interest": 21,
    "investment_basics": 20,
    "tax_planning": 31,
    "salary_and_income_management": 27,
    "emi_and_debt_calculation": 9,
    "smart_spending_habits": 30,
    "health_insurance_guidance": 16,
    "retirement_planning": 26,
    "education_loans": 7,
    "vehicle_loans": 34,
    "monthly_budget_planning": 22,
    "emergency_fund_creation": 8,
    "understanding_credit_score": 32,
    "mutual_funds": 23,
    "fixed_deposits": 14,
    "inflation_and_purchasing_power": 18,
    "home_buying_finances": 17,
    "balance_transfers": 0,
    "debt_traps": 6,
    "financial_security_tips": 13,
    "freelance_and_gig_economy_finance": 15,
    "finance_apps_usage": 12,
    "bank_account_linking": 1,
    "paying_utility_bills": 24,
    "cryptocurrency_basics": 5,
    "setting_financial_goals": 29,
    "international_money_transfers": 19,
    "bank_charges": 2,
    "filing_tax_returns": 11,
    "upi_and_online_payment_safety": 33,
    "planning_for_annual_expenses": 25
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_balance_transfers": 12,
    "utter_bank_account_linking": 13,
    "utter_bank_charges": 14,
    "utter_budgeting_tips": 15,
    "utter_credit_card_management": 16,
    "utter_cryptocurrency_basics": 17,
    "utter_debt_traps": 18,
    "utter_education_loans": 19,
    "utter_emergency_fund_creation": 20,
    "utter_emi_and_debt_calculation": 21,
    "utter_expense_tracking": 22,
    "utter_filing_tax_returns": 23,
    "utter_finance_apps_usage": 24,
    "utter_financial_security_tips": 25,
    "utter_fixed_deposits": 26,
    "utter_freelance_and_gig_economy_finance": 27,
    "utter_health_insurance_guidance": 28,
    "utter_home_buying_finances": 29,
    "utter_inflation_and_purchasing_power": 30,
    "utter_international_money_transfers": 31,
    "utter_investment_basics": 32,
    "utter_loans_and_interest": 33,
    "utter_monthly_budget_planning": 34,
    "utter_mutual_funds": 35,
    "utter_paying_utility_bills": 36,
    "utter_planning_for_annual_expenses": 37,
    "utter_retirement_planning": 38,
    "utter_salary_and_income_management": 39,
    "utter_saving_strategies": 40,
    "utter_setting_financial_goals": 41,
    "utter_smart_spending_habits": 42,
    "utter_tax_planning": 43,
    "utter_understanding_credit_score": 44,
    "utter_upi_and_online_payment_safety": 45,
    "utter_vehicle_loans": 46
  },
  "action_text": null,
  "intent_response_key": null
}