{
  "text": {
    "how": 183,
    "can": 57,
    "i": 185,
    "budget": 50,
    "better": 43,
    "what": 408,
    "are": 23,
    "some": 346,
    "budgeting": 51,
    "tips": 378,
    "give": 169,
    "me": 233,
    "for": 153,
    "making": 228,
    "a": 1,
    "monthly": 242,
    "do": 107,
    "create": 86,
    "plan": 278,
    "suggest": 364,
    "ways": 406,
    "to": 379,
    "allocate": 13,
    "my": 248,
    "income": 194,
    "s": 322,
    "the": 372,
    "__number__": 0,
    "rule": 321,
    "start": 351,
    "zero": 423,
    "based": 38,
    "any": 18,
    "advice": 8,
    "staying": 353,
    "within": 418,
    "save": 326,
    "more": 243,
    "money": 239,
    "good": 172,
    "saving": 327,
    "strategies": 358,
    "build": 52,
    "savings": 328,
    "share": 339,
    "on": 260,
    "every": 128,
    "paycheck": 270,
    "should": 340,
    "automate": 29,
    "best": 42,
    "way": 405,
    "increase": 195,
    "emergency": 119,
    "fund": 162,
    "help": 177,
    "set": 337,
    "goal": 170,
    "track": 381,
    "expenses": 133,
    "record": 305,
    "spending": 347,
    "logging": 222,
    "daily": 92,
    "monitor": 240,
    "bills": 45,
    "recommend": 304,
    "apps": 22,
    "expense": 132,
    "tracking": 382,
    "use": 392,
    "spreadsheet": 349,
    "costs": 82,
    "categorize": 65,
    "effectively": 117,
    "suggestions": 365,
    "subscriptions": 362,
    "manage": 229,
    "credit": 87,
    "card": 60,
    "debt": 96,
    "usage": 391,
    "avoid": 32,
    "late": 212,
    "fees": 142,
    "pay": 269,
    "off": 257,
    "cards": 61,
    "maximize": 232,
    "reward": 319,
    "points": 282,
    "improve": 190,
    "utilization": 394,
    "transfer": 384,
    "balance": 33,
    "often": 259,
    "check": 70,
    "statement": 352,
    "loans": 221,
    "work": 419,
    "is": 207,
    "loan": 220,
    "interest": 199,
    "calculate": 56,
    "emi": 120,
    "explain": 134,
    "principal": 291,
    "vs": 402,
    "options": 264,
    "exist": 131,
    "fixed": 151,
    "variable": 397,
    "rates": 302,
    "differ": 104,
    "negotiate": 252,
    "lower": 226,
    "rate": 301,
    "errors": 124,
    "when": 409,
    "borrowing": 49,
    "an": 15,
    "investment": 202,
    "investing": 201,
    "basics": 39,
    "of": 256,
    "index": 196,
    "funds": 163,
    "diversify": 106,
    "portfolio": 285,
    "buy": 53,
    "stocks": 355,
    "or": 265,
    "etfs": 125,
    "much": 245,
    "beginner": 40,
    "invest": 200,
    "thumb": 375,
    "risk": 320,
    "reduce": 306,
    "taxes": 370,
    "tax": 368,
    "planning": 279,
    "filing": 146,
    "deductions": 98,
    "documents": 108,
    "need": 250,
    "hra": 184,
    "exemption": 130,
    "capital": 58,
    "gains": 166,
    "deadline": 95,
    "salary": 325,
    "allocating": 14,
    "irregular": 206,
    "portion": 286,
    "handle": 174,
    "bonuses": 48,
    "split": 348,
    "multiple": 246,
    "streams": 359,
    "side": 342,
    "gig": 168,
    "earnings": 114,
    "figure": 144,
    "out": 266,
    "repayment": 311,
    "show": 341,
    "formula": 155,
    "will": 414,
    "long": 223,
    "it": 208,
    "take": 367,
    "clear": 73,
    "pre": 288,
    "compare": 76,
    "two": 386,
    "offers": 258,
    "control": 80,
    "overspending": 268,
    "stop": 356,
    "impulse": 191,
    "buys": 54,
    "frugal": 160,
    "living": 218,
    "evaluate": 127,
    "wants": 404,
    "needs": 251,
    "cash": 62,
    "envelopes": 123,
    "review": 316,
    "day": 94,
    "freeze": 158,
    "choose": 71,
    "health": 175,
    "insurance": 198,
    "look": 224,
    "in": 192,
    "policy": 283,
    "premiums": 289,
    "family": 137,
    "floater": 152,
    "deductible": 97,
    "coverage": 83,
    "port": 284,
    "claim": 72,
    "cashless": 63,
    "benefits": 41,
    "retirement": 314,
    "pension": 275,
    "plans": 280,
    "k": 209,
    "ira": 205,
    "adjust": 7,
    "inflation": 197,
    "safe": 323,
    "withdrawal": 417,
    "education": 116,
    "apply": 20,
    "student": 360,
    "typical": 388,
    "federal": 140,
    "private": 294,
    "repay": 310,
    "defer": 99,
    "payments": 274,
    "grace": 173,
    "period": 277,
    "consolidate": 78,
    "vehicle": 398,
    "car": 59,
    "auto": 28,
    "lease": 213,
    "finance": 147,
    "score": 331,
    "refinance": 307,
    "balloon": 34,
    "payment": 273,
    "down": 111,
    "ideal": 186,
    "up": 389,
    "and": 16,
    "include": 193,
    "by": 55,
    "category": 66,
    "mid": 236,
    "month": 241,
    "revising": 317,
    "percentage": 276,
    "fun": 161,
    "where": 410,
    "keep": 210,
    "one": 261,
    "why": 412,
    "important": 189,
    "deposits": 103,
    "top": 380,
    "affects": 10,
    "view": 400,
    "does": 109,
    "impact": 188,
    "dispute": 105,
    "mutual": 247,
    "they": 374,
    "types": 387,
    "them": 373,
    "nav": 249,
    "deposit": 102,
    "open": 263,
    "fd": 138,
    "returns": 315,
    "withdraw": 416,
    "early": 113,
    "cumulative": 91,
    "ladder": 211,
    "fds": 139,
    "taxable": 369,
    "affect": 9,
    "purchasing": 300,
    "power": 287,
    "hedge": 176,
    "against": 11,
    "losing": 225,
    "value": 396,
    "cpi": 85,
    "real": 303,
    "causes": 67,
    "home": 182,
    "mortgage": 244,
    "get": 167,
    "rent": 309,
    "closing": 75,
    "approved": 21,
    "worth": 420,
    "doing": 110,
    "involved": 204,
    "promo": 297,
    "from": 159,
    "catch": 64,
    "trap": 385,
    "payday": 271,
    "avalanche": 31,
    "snowball": 345,
    "managing": 230,
    "high": 179,
    "consolidation": 79,
    "with": 415,
    "creditors": 88,
    "ensure": 122,
    "financial": 148,
    "security": 333,
    "stable": 350,
    "future": 164,
    "protect": 298,
    "assets": 25,
    "measures": 234,
    "dependents": 101,
    "legal": 214,
    "steps": 354,
    "secure": 332,
    "wealth": 407,
    "freelance": 157,
    "economy": 115,
    "invoice": 203,
    "clients": 74,
    "form": 154,
    "llc": 219,
    "accounting": 5,
    "project": 296,
    "banking": 36,
    "alerts": 12,
    "which": 411,
    "app": 19,
    "tracks": 383,
    "link": 216,
    "accounts": 6,
    "subscription": 361,
    "export": 135,
    "data": 93,
    "privacy": 293,
    "settings": 338,
    "matter": 231,
    "bank": 35,
    "account": 4,
    "revoke": 318,
    "access": 3,
    "banks": 37,
    "see": 334,
    "fix": 150,
    "linking": 217,
    "oauth": 255,
    "test": 371,
    "connectivity": 77,
    "utility": 393,
    "online": 262,
    "method": 235,
    "electricity": 118,
    "autopay": 30,
    "bill": 44,
    "history": 181,
    "support": 366,
    "reminders": 308,
    "cryptocurrency": 90,
    "crypto": 89,
    "nfts": 253,
    "store": 357,
    "safely": 324,
    "blockchain": 47,
    "volatile": 401,
    "bitcoin": 46,
    "ethereum": 126,
    "defi": 100,
    "platforms": 281,
    "goals": 171,
    "smart": 344,
    "prioritize": 292,
    "you": 422,
    "progress": 295,
    "timeline": 377,
    "over": 267,
    "time": 376,
    "send": 335,
    "abroad": 2,
    "service": 336,
    "fx": 165,
    "cost": 81,
    "exchange": 129,
    "hidden": 178,
    "limits": 215,
    "maintenance": 227,
    "charges": 69,
    "charge": 68,
    "atm": 26,
    "non": 254,
    "sufficient": 363,
    "fee": 141,
    "waivers": 403,
    "minimum": 237,
    "find": 149,
    "schedules": 330,
    "file": 145,
    "required": 313,
    "e": 112,
    "mistakes": 238,
    "hire": 180,
    "cpa": 84,
    "upi": 390,
    "prevent": 290,
    "fraud": 156,
    "enable": 121,
    "factor": 136,
    "auth": 27,
    "public": 299,
    "wi": 413,
    "fi": 143,
    "verify": 399,
    "payees": 272,
    "if": 187,
    "scammed": 329,
    "report": 312,
    "annual": 17,
    "yearly": 421,
    "aside": 24,
    "sinking": 343,
    "vacations": 395
  },
  "intent": {
    "budgeting_tips": 3,
    "saving_strategies": 28,
    "expense_tracking": 10,
    "credit_card_management": 4,
    "loans_and_interest": 21,
    "investment_basics": 20,
    "tax_planning": 31,
    "salary_and_income_management": 27,
    "emi_and_debt_calculation": 9,
    "smart_spending_habits": 30,
    "health_insurance_guidance": 16,
    "retirement_planning": 26,
    "education_loans": 7,
    "vehicle_loans": 34,
    "monthly_budget_planning": 22,
    "emergency_fund_creation": 8,
    "understanding_credit_score": 32,
    "mutual_funds": 23,
    "fixed_deposits": 14,
    "inflation_and_purchasing_power": 18,
    "home_buying_finances": 17,
    "balance_transfers": 0,
    "debt_traps": 6,
    "financial_security_tips": 13,
    "freelance_and_gig_economy_finance": 15,
    "finance_apps_usage": 12,
    "bank_account_linking": 1,
    "paying_utility_bills": 24,
    "cryptocurrency_basics": 5,
    "setting_financial_goals": 29,
    "international_money_transfers": 19,
    "bank_charges": 2,
    "filing_tax_returns": 11,
    "upi_and_online_payment_safety": 33,
    "planning_for_annual_expenses": 25
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_balance_transfers": 12,
    "utter_bank_account_linking": 13,
    "utter_bank_charges": 14,
    "utter_budgeting_tips": 15,
    "utter_credit_card_management": 16,
    "utter_cryptocurrency_basics": 17,
    "utter_debt_traps": 18,
    "utter_education_loans": 19,
    "utter_emergency_fund_creation": 20,
    "utter_emi_and_debt_calculation": 21,
    "utter_expense_tracking": 22,
    "utter_filing_tax_returns": 23,
    "utter_finance_apps_usage": 24,
    "utter_financial_security_tips": 25,
    "utter_fixed_deposits": 26,
    "utter_freelance_and_gig_economy_finance": 27,
    "utter_health_insurance_guidance": 28,
    "utter_home_buying_finances": 29,
    "utter_inflation_and_purchasing_power": 30,
    "utter_international_money_transfers": 31,
    "utter_investment_basics": 32,
    "utter_loans_and_interest": 33,
    "utter_monthly_budget_planning": 34,
    "utter_mutual_funds": 35,
    "utter_paying_utility_bills": 36,
    "utter_planning_for_annual_expenses": 37,
    "utter_retirement_planning": 38,
    "utter_salary_and_income_management": 39,
    "utter_saving_strategies": 40,
    "utter_setting_financial_goals": 41,
    "utter_smart_spending_habits": 42,
    "utter_tax_planning": 43,
    "utter_understanding_credit_score": 44,
    "utter_upi_and_online_payment_safety": 45,
    "utter_vehicle_loans": 46
  },
  "action_text": null,
  "intent_response_key": null
}